modules/models/Admin.php

    public function validatePass(){
        if(!$this->hasErrors()){
            //if there is no error before this condition check
            $data = self::find()->where('adminuser =:user and adminpass = :pass',  [":user"=> $this->adminuser, ":pass"=> md5($this->adminpass)])->one();
---
SELECT * FROM `shop_admin` WHERE adminuser ='admin' and adminpass = '202cb962ac59075b964b07152d234b70'

    public function login($data){
        $this->scenario = "login";
        if($this->load($data) && $this->validate()){
            //login if without error
            // Session for one day
            $lifetime = $this->rememberMe ? 24*3600 : 0;
            $session = Yii::$app->session;
            session_set_cookie_params($lifetime);
            $session['admin'] =[
                'adminuser' => $this->adminuser,
                'isLogin' => 1,
            ];
            //update ip and logintime
//            $this->updateAll(['logintime'=> time(),'loginip'=> ip2long(Yii::$app->request->userIP)],'adminuser = :user', [':user'=> $this->adminuser]);
            $this->updateAll(['logintime'=> time(),'loginip'=> 0],'adminuser = :user', [':user'=> $this->adminuser]);
---
UPDATE `shop_admin` SET `logintime`='1502806110', `loginip`='0' WHERE adminuser = 'admin'