modules/models/Category.php

INSERT INTO `shop_category` (`parentid`, `title`, `createtime`) VALUES ('0', 'Iphones', '1502806584')
---
    public function add($data){
        $data['Category']['createtime'] = time();
        if($this->load($data) && $this->save()){

SELECT * FROM `shop_category`
---
    public function getData(){
        $cates = self::find()->all();