modules/models/Product.php

    public function add($data)
    {

        if ($this->load($data) && $this->save()) {
---
INSERT INTO `shop_product` (`cover`, `pics`, `cateid`, `title`, `descr`, `price`, `ishot`, `issale`, `saleprice`, `num`, `istui`) VALUES ('main-qimg-cf89aa517e5b641dc8e41e7a57bafc2c.png', '{\"IMG_20170813_173832\":\"IMG_20170813_173832.jpg\"}', '4', 'iphone 7', 'Latest iphone. donate blood pls', '2400', '0', '0', '1200', '5', '0')