modules/controllers/CategoryController.php

    public function actionMod(){
        $cateid = Yii::$app->request->get("cateid");
        $model = Category::find()->where('cateid=:id',[':id'=>$cateid])->one();
---
SELECT * FROM `shop_category` WHERE cateid='4'