modules/controllers/ManageController.php

SELECT COUNT(*) FROM `shop_admin`
SELECT * FROM `shop_admin` LIMIT 10
---
    public function actionAdmins()
    {
        $model = Admin::find();
        $count = $model->count();
        //page size = how many data in one page
        $pageSize = Yii::$app->params['pageSize']['manage'];
        $pager = new Pagination(['totalCount' => $count, 'pageSize' => $pageSize]);
        $admins = $model->offset($pager->offset)->limit($pager->limit)->all();