modules/controllers/ProductController.php

    public function actionList(){
        $model = Product::find();
        $count = $model->count();
        $pageSize = Yii::$app->params['pageSize']['product'];
        $pager = new Pagination(['totalCount'=>$count, 'pageSize'=>$pageSize]);

        $products = $model->offset($pager->offset)->limit($pager->limit)->all();
---
SELECT COUNT(*) FROM `shop_product`
SELECT * FROM `shop_product` LIMIT 10

    public function actionMod(){
        $productid = Yii::$app->request->get("productid");
        $model = Product::find()->where('productid=:id',[':id'=>$productid])->one();
---
SELECT * FROM `shop_product` WHERE productid='3'